app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "this is the newest post withasdfasdfasdf a new description"], ["updated_at", "2021-03-02 04:28:42.523501"], ["id", 14]]